/**
 * Інтерфейс для окремого Питання
 */
export interface Question {
  /**
   * Текстова версія питання
   */
  text: string;

  /**
   * Кількість балів за питання.
   */
  points: number;

  /**
   * Тип вмісту питання.
   * - 'text': Питання є простим текстом.
   * - 'image': Питання містить посилання на зображення.
   * - 'video': Питання містить посилання на відео.
   */
  type: 'text' | 'image' | 'video';

  /**
   * Вміст питання. Це може бути текст, URL-адреса зображення або ID/URL відео.
   */
  content: string;

  /**
   * Необов'язкова підказка до питання (наприклад, для шифрованих мемів).
   */
  hint?: string;

  /**
   * Правильна відповідь на питання.
   */
  answer: string;
}

/**
 * Інтерфейс для Категорії
 */
export interface Category {
  /**
   * Назва (заголовок) категорії.
   */
  title: string;

  /**
   * Масив питань, що належать до цієї категорії.
   */
  questions: Question[];
}

/**
 * Основний інтерфейс для структури всієї гри
 */
export interface GameData {
  /**
   * Масив усіх категорій гри.
   */
  categories: Category[];
}
